"""
Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали n журавликов.

Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое 
количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

Выведите через пробел количество журавликов, сделанных Петей, Катей и Сережей.
"""
n = 60

n1 = n // 6
n2 = n // 6
n3 = (n // 6) * 4
print(n1, n3, n2)

"""
Альтернативное решение
"""

def find_cranes_count(n):
    x = n // 6  # Общее количество журавликов деленное на 6 (1 Петя + 4 Катя + 1 Сережа)
    return x, 4*x, x
petya, katya, serezha = find_cranes_count(n)
print(petya, katya, serezha)
